import React from "react";

import styles from "./license.module.scss";

function License({ action }) {
  return (
    <div className={styles.container}>
      <h1>تعهد الخصوصية لشركة سمارت فارما الطبية</h1>
      <p>
        شركة سمارت فارما التضامنية ملتزمة بحماية خصوصية بيانات كل مستخدمي موقعنا
        على الانترنت أو تطبيق الهاتف المحمول الخاص بنا. يرجى قراءة سياسة
        الخصوصية التالية و التي توضح كيف نستعمل ونحمي معلوماتك. سنكون المتحكمين
        بالبيانات التي تقدمها لنا.{" "}
      </p>
      <hr />
      <ul className={styles.first}>
        <li>
          <strong>بيانات المتصل:</strong> إذا كان لديك أي استفسارات أو طلبات
          بخصوص سياسة الخصوصية هذه أو كيف نتعامل مع بياناتك بشكل عام، يرجى
          الاتصال بنا باستخدام التفاصيل التالية: عبر الهاتف على الرقم:
          0943063066 أو عن طريق الايميلsmartpharma.sy@gmail.com
        </li>
        <li>
          <strong>كيف نقوم بجمع معلوماتك:</strong> : نقوم بجمع معلوماتك الشخصية
          عندما تتفاعل معنا أو تستخدم خدماتنا، مثلا عندما تستخدم مواقعنا لإرسال
          طلب. وننظر أيضا في كيفية استخدام الزوار لمواقعنا، لمساعدتنا على تحسين
          خدماتنا و تحسين تجربة العملاء.
        </li>
        <li>
          <strong>نقوم بجمع المعلومات:</strong>
          <ul className={styles.second}>
            <li>عند إنشاء حساب معنا أو تغيير إعدادات حسابك</li>
            <li>
              عند إرسال طلب الينا و أثناء عملية الطلب (بما في ذلك انشاء و تسليم
              الطلب).
            </li>
            <li>
              عند الاتصال بنا مباشرة عبر البريد الإلكتروني أو الهاتف أو الرسالة
              أو عبر وظيفة تواصل معنا.
            </li>
          </ul>
        </li>
        <li>
          <strong>المعلومات التي نجمعها عنك</strong> كجزء من التزامنا بخصوصية
          عملائنا و زائري مواقعنا بشكل عام، نريد أن نكون واضحين بشأن أنواع
          المعلومات التي سنجمعها منك. عند إرسال طلب من خلال منصة سمارت فارما
          لأول مرة يطلب منك تقديم معلومات عن نفسك بما في ذلك اسمك و تفاصيل
          الاتصال و عنوانك التفصيلي و معلومات عنك من أي رسائل ترسلها الينا أو
          عند الاتصال بنا أو تزويدنا بتعليقات، بما في ذلك عبر البريد الالكتروني
          أو الهاتف. إذا اتصلت بنا عبر الهاتف، فسوف نسجل المكالمة لأغراض التدريب
          و تحسين الخدمة، ونقوم بتدوين ملاحظات فيما يتعلق بالمكالمة. نقوم بجمع
          معلومات فنية من جهازك المحمول او جهاز الحاسب الخاص بك، مثل نظام
          التشغيل الخاص به، و الجهاز و نوعه و نوع الاتصال و عنوان IP الذي تدخل
          منه الى مواقعنا.{" "}
        </li>
        <li>
          <strong>استخدام المعلومات الخاصة بك</strong> سنقوم بمعالجة البيانات
          التي نجمعها عنك فقط إذا كان هناك سبب للقيام بذلك، وإذا كان هذا السبب
          مسموحاً به بموجب المرسوم التشريعي رقم 17 لعام 2012 ضمن قانون تنظيم
          التواصل على الشبكة ومكافحة الجريمة المعلوماتية. سيكون لدينا أساس
          قانوني لمعالجة المعلومات الخاصة بك؛ إذا كنا بحاجة إلى معالجة المعلومات
          الخاصة بك من أجل تزويدك بالخدمة التي طلبتها أو للدخول في عقد فلدينا
          موافقتك و لدينا سبب مبرر لمعالجة بياناتك، أو نحن ملزمون قانونا بالقيام
          بذلك.
        </li>
        <p className={styles.strong}>
          حيثما نحتاج لتزويدك بالخدمة التي طلبتها أو للدخول في عقد فإننا نستخدم
          معلوماتك:{" "}
        </p>
        <ul className={styles.second}>
          <li>لتمكيننا من تزويدك بالوصول الى الأجزاء ذات الصلة بالمنصة.</li>
          <li>لتوفير الخدمات التي طلبتها.</li>
          <li>لتمكيننا من تحصيل المدفوعات منك.</li>
          <li>
            للاتصال بك عند الضرورة فيما يتعلق بخدماتنا، مثل حل المشكلات التي قد
            تواجهنا في طلبك.{" "}
          </li>
        </ul>
        <p className={styles.strong}>
          نقوم أيضا بمعالجة بياناتك حيث يكون لدينا سبب مبرر للقيام بذلك، على
          سبيل المثال تخصيص خدماتنا، بما في ذلك معالجة البيانات لجعل الأمر أسهل
          وأسرع بالنسبة لك لتقديم الخدمات. أدرجنا هذه الأسباب أدناه:{" "}
        </p>
        <ul className={styles.second}>
          <li>
            تحسين فعالية و جودة الخدمة التي يتوقعها عملاؤنا منا في المستقبل.
          </li>
          <li>
            لتخصيص المحتوى الذي نعرضه لك، نحن أو أي مستودع او شركة مشتركة أو
            شركاء الإعلان، على سبيل المثال حتى نتمكن من عرض المستودعات او
            الشركات الموجودة في منطقتك أو التأكد من أنك ترى الإعلان الأكثر صلة
            بك استنادا الى الخصائص المحددة بواسطتنا
          </li>
          <li>
            لتمكين فريق دعم العملاء لدينا من مساعدتك في أي استفسارات أو شكاوى
            بأكثر الطرق فعالية ممكنة ولتقديم تجربة إيجابية للعملاء.
          </li>
          <li>
            للاتصال بك و الاطلاع على آرائك و ملاحظاتك على خدماتنا و إبلاغك إذا
            كانت هناك اي تغييرات أو تطورات مهمة على المواقع أو خدماتنا، بما في
            ذلك إعلامك بأن خدماتنا تعمل في منطقة جديدة، في حال كنت قد طلبت منا
            فعل ذلك.
          </li>
          <li>لإرسال معلومات إليك عن منتجاتنا و خدماتنا و عروضنا الترويجية.</li>
          <li>
            لتحليل نشاطك على المواقع حتى نتمكن من إدارة و دعم و تحسين و تطوير
            أعمالنا لأغراض إحصائية و تحليلية و لمساعدتنا على منع الاحتيال.
          </li>
          <li>
            لفرض شروطنا التعاقدية معك و أي اتفاقية أخرى، و لممارسة أو الدفاع عن
            المطالبات القانونية و حماية حقوق سمارت فارما أو المستودعات الشريكة
            معنا أو مقدمي خدمات التوصيل أو غيرهم، بما في ذلك منع الاحتيال.
          </li>
          <li>
            إذا قدمت تعليقات بشأن المواقع و الخدمات، فقد نستخدم هذة التعليقات في
            أي مواد تسويقية أو إعلانية. سوف نحدد هويتك لهذا الغرض فقط باسمك
            الأول و المدينة التي تعيش فيها.
          </li>
          <li>
            في حال اخترت تلقي إعلانات من خلال تطبيق الهاتف المحمول الخاص بنا
            فسنرسل إليك إعلانات متعلقة بالخدمات التي طلبتها منا و معلومات حول
            خدماتنا و عروضنا.
          </li>
        </ul>
        <p>
          سنقوم أيضا بتحليل البيانات المتعلقة باستخدامك لخدماتنا من بيانات موقعك
          لإنشاء ملفات تعريفية متعلقة بك و لك.{" "}
        </p>
        <p>
          هذا يعني أننا قد نضع بعض الافتراضات حول ما قد تهتم به و نستخدمه، لنرسل
          لك المزيد من الاتصالات التسويقية المصممة خصيصا لك، و لنقدم المستودعات
          التي نعتقد أنك تفضلها، أو لإعلامك بالعروض الخاصة أو المنتجات التي
          نعتقد أنك قد تكون مهتما بها. يشار إلى هذا النشاط باسم التنميط. لديك
          حقوق معينة فيما يتعلق بهذا النوع من المعالجة. الرجاء مراجعة قسم
          "حقوقك" أدناه لمزيد من المعلومات.{" "}
        </p>
        <p className={styles.strong}>
          عندما نكون ملزمين قانونيا بالقيام بذلك، يجوز لنا استخدام معلوماتك من
          أجل:
        </p>
        <ul className={styles.second}>
          <li>إنشاء سجل لطلبك. </li>
          <li>الامتثال لأي التزام قانوني أو شروط تنظيمية نتعرض له.</li>
        </ul>
        <li>
          <strong>التسويق المباشر:</strong> في حال منحنا موافقتك أو عندما يكون
          لدينا سبب مبرر للقيام بذلك، سنستخدم معلوماتك لإعلامك بمنتجاتنا و
          خدماتنا الأخرى التي قد تهمك عن طريق البريد الإلكتروني أو الهاتف. يمكنك
          التحكم في تفضيلات التسويق عبر البريد الإلكتروني الخاصة بك من خلال:
          <ul className={styles.second}>
            <li>تطبيق الهاتف المحمول </li>
            <li>أو موقعنا على شبكة الإنترنت </li>
          </ul>
        </li>
        <li>
          <strong>الاحتفاظ بمعلوماتك :</strong> لن نحتفظ بمعلوماتك لفترة أطول
          مما نعتقد أنه ضروري. سيتم الاحتفاظ بالمعلومات التي نجمعها ما دامت هناك
          حاجة للوفاء بالأغراض الموضحة في قسم "استخدام المعلومات الخاصة بك"
          أعلاه بما يتماشى مع مصلحتنا المشروعة أو لفترة تشترطها على وجه التحديد
          اللوائح أو القوانين المعمول بها، مثل الحفاظ على المعلومات لأغراض
          التقارير التنظيمية.
        </li>
        <p className={styles.strong}>
          عند تحديد فترات الاستبقاء ذات الصلة، سنأخذ في الاعتبار العوامل
          التالية:
        </p>
        <ul>
          <li>التزامتنا و حقوقنا التعاقدية فيما يتعلق بالمعلومات المعنية. </li>
          <li>
            التزامات قانونية بموجب القانون المعمول به بالاحتفاظ بالبيانات لفترة
            زمنية معينة
          </li>
          <li>المنازعات المحتملة.</li>
          <li>
            إرشادات صادرة عن الهيئة الوطنية لخدمات الشبكة والهيئات الحكومية ذات
            الصلة.
          </li>
        </ul>
        <p>
          بخلاف ذلك، نقوم بمسح معلوماتك بشكل آمن حيث لم نعد نحتاج الى معلوماتك
          للأغراض التي تم جمعها
        </p>
        <li>
          <strong>الكشف عن معلوماتك:</strong> سيتم نقل المعلومات التي نجمعها عنك
          و تخزينها على خوادمنا الموجودة داخل الجمهورية العربية السورية. نحن
          حريصون و شفافون للغاية بشأن من تتم مشاركة معلوماتك معه.
        </li>
        <p className={styles.strong}>
          نحن نشارك معلوماتك مع مزودي خدمة الطرف الثالث. تشمل أنواع مزودي خدمة
          الجهات الخارجية الذين نشاركهم معلوماتك معهم:
        </p>
        <ul className={styles.second}>
          <li>
            المستودعات الشريكة: نقوم بتزويد المستودعات الشريكة بمعلوماتك عند
            قيامك بالطلب منهم حتى يتمكنوا من تلبية طلبك، أو لحل المشاكل أو تحسين
            خدماتهم.
          </li>
          <li>مخدمي التوصيل: حتى يتمكنوا من توصيل الطلب لك.</li>
          <li>
            موظفي قسم خدمة العملاء: من سيساعدنا على حل أي مشكلات قد تواجهك في
            خدماتنا.
          </li>
          <li>
            شركاء التسويق و الإعلان: حتى يتمكنوا من التأكد من أنك ترى الإعلان
            الأكثر صلة بك و يرسلو إليك البريد الالكتروني و التسويق البريدي نيابة
            عنا. ستتخذ سمارت فارما جميع الخطوات اللازمة بشكل معقول لضمان التعامل
            مع بياناتك بشكل آمن ووفقا لسياسة الخصوصية هذه عند نقلها الى جهات
            خارجية. إذا دخل نشاطنا التجاري في مشروع مشترك مع كيان تجاري آخر أو
            تم شراؤه أو بيعه مع كيان تجاري آخر، فقد يتم الكشف عن معلوماتك أو
            نقلها الى الشركة المستهدفة أو شركاء أعمالنا الجدد أو مالكيها أو
            مستشاريهم
          </li>
        </ul>
        <p className={styles.strong}>قد نشارك أيضا معلوماتك:</p>
        <ul className={styles.second}>
          <li>
            إذا كنا ملزمين بالكشف عن معلوماتك أو مشاركتها من أجل الامتثال ( و/
            أو عندما نعتقد أننا ملزمون بالامتثال) لأي التزام قانوني أو أمر قضائي
            أو شرط تنظيمي. يتضمن ذلك تبادل المعلومات مع الشركات الأخرى و
            المؤسسات الأخرى لأغراض الحماية من الاحتيال و الوقاية منه.
          </li>
          <li>من أجل إنفاذ شروطنا التعاقدية معك و أي اتفاقية أخرى.</li>
          <li>
            لحماية حقوق سمارت فارما أو المستودعات الشريكة أو مقدمي خدمات التوصيل
            أو غيرهم، بما في ذلك منع الاحتيال.
          </li>
          <li>
            ومع الأطراف الثالثة التي نعتبرها ضرورية بشكل معقول من أجل منع
            الجريمة، على سبيل المثال الضابطة العدلية.
          </li>
        </ul>
        <li>
          <strong>حقوقك:</strong> بموجب قانون تنظيم التواصل على الشبكة ومكافحة
          الجريمة المعلوماتية، قد يكون لديك عدد من الحقوق المتعلقة بالبيانات
          التي نحتفظ بها عنك. إذا كنت ترغب في ممارسة أي من هذه الحقوق، يرجى
          الاتصال بمسؤول حماية البيانات لدينا باستخدام تفاصيل الاتصال المذكورة
          أعلاه. للحصول على معلومات إضافية حول حقوقك يرجى مراجعة المرسوم
          التشريعي رقم 17 لعام 2012 والمتضمن قانون تنظيم التواصل على الشبكة
          ومكافحة الجريمة المعلوماتية .
        </li>
        <li>
          <strong>التغييرات في سياسة الخصوصية لدينا:</strong> سيتم نشر أي
          تغييرات تطرأ على سياسة الخصوصية الخاصة بنا على مواقعنا، عند الاقتضاء،
          سوف نخبرك بالتغييرات على سبيل المثال عن طريق البريد الالكتروني، أو
          باقي وسائل التواصل الإجتماعي وعبر خدمة العملاء.
        </li>
        <li>
          <strong>الشكاوى:</strong> إذا لم تكن راضيا عن ردنا على أي شكوى أو
          تعتقد أن معالجتنا لمعلوماتك لاتتوافق مع قانون تنظيم التواصل على الشبكة
          ومكافحة الجريمة المعلوماتية، يمكنك تقديم شكوى الى مكتب امن المعلومات
          باستخدام التفاصيل التالية: رقم الهاتف: 0943063066 عنوان البريد
          الالكتروني: smartpharma.sy@gmail.com
        </li>
      </ul>
      {action && (
        <button
          onClick={() => {
            action();
          }}
        >
          أوافق على شروط الخصوصية، إنشاء حساب
        </button>
      )}
    </div>
  );
}

export default License;
