import React from "react";

import styles from "./my-points-description-ar.module.scss";

const MyPointsDescriptionAr = () => {
  return (
    <div className={styles.container}>
      <h3>برنامج نقاط ولاء</h3>
      <p>
        برنامج نقاط ولاء هو طريقتنا لنعبر عن تقديرنا واهتمامنا بك كشريك معنا من
        خلال الهدايا والمزايا الخاصة المقدمة لك{" "}
      </p>
      <p className={styles.strong}>مضمون برنامج نقاط ولاء</p>
      <ul className={styles.first}>
        <li>يمكنك الاشتراك في برنامج نقاط ولاء مجانا من خلال التطبيق الذكي</li>
        <li>
          للاشتراك في برنامج نقاط ولاء يجب ان يكون لديك رقم موبايل فعال ومحقق
          ويحتوي على واتساب وصادر من الجمهورية العربية السورية.
        </li>
        <li>
          لكي نتمكن من ايصال النصائح والعروض المناسبة لاحتياجاتك قد نطلب منك
          تحديث بياناتك وتفضيلاتك مرة واحدة كل ستة أشهر.
        </li>
        <li>
          ان عدم اكتساب او استبدال نقاط لفترة تزيد عن ستة أشهر متواصلة يؤدي الى
          انتهاء صلاحية نقاطك.
        </li>
      </ul>
      <p className={styles.strong}>كيفية جمع النقاط:</p>
      <ul className={styles.first}>
        <li>
          ستحصل على نقطة واحدة فقط مقابل كل قيمة معينة تم شرائها من احد
          المستودعات الداخلة ضمن برنامج نقاط ولاء من خلال التطبيق والتي سوف تكون
          واضحة بملاحظة أسفل كل اسم مستودع من خلال قسم المستودعات.
        </li>
        <li>
          يمكن أيضا الحصول على نقاط إضافية من خلال العروض المخصصة على بعض
          المنتجات لزيادة رصيدك من النقاط.
        </li>
        <li>تضاف النقاط الى حسابك خلال 24 ساعة كحد اقصى من عملية الشراء.</li>
        <li>
          يحق لك المطالبة بأي نقاط غير مضافة الى حسابك بناءاً على مشترياتك خلال
          اسبوع بحد اقصى من تاريخ عملية الشراء باستخدام فاتورة العملية الشرائية.
        </li>
        <li>
          لا يمكن جمع النقاط على قيمة النقاط المستبدلة في العمليات الشرائية التي
          يتم دفع قيمتها أو جزء من قيمتها باستخدام النقاط المستبدلة.
        </li>
      </ul>
      <p className={styles.strong}>استبدال النقاط</p>
      <ul className={styles.first}>
        <li>
          يجب ان يتم التواصل مع الرقم الموحد لخدمة العملاء على الرقم: 0956660333
          لإعلامهم باستبدال النقاط التي بحسابك واقتطاعها من جزء او كل من قيمة
          الطلبية الأخيرة فور طلبها مباشرة.
        </li>
        <li>
          يمكنك استبدال النقاط بالمنتجات عند جمع 499 نقطة على الاقل ويكون الحد
          الأدنى لقيمة الاستبدال 50,000 ليرة سورية.{" "}
        </li>
        <li>
          يحق لشركة سمارت فارما التحقق من ملكية الحساب عند طلب استبدال النقاط عن
          طريق قسم خدمة العملاء.
        </li>
      </ul>
      <p className={styles.strong}>انتهاء صلاحية النقاط</p>
      <p>
        تكون مدة سريان فعالية النقاط المضافة ستة أشهر من تاريخ إضافة اول نقطة
        الى الحساب وتلغى في حال لم يتم استبدالها خلال المدة المذكورة.
      </p>
      <p className={styles.strong}>شروط عامّة</p>
      <p>
        يؤدي عدم الإمتثال لشروط وأحكام برنامج نقاط ولاء الخاص بتطبيق سمارت فارما
        او إساءة استخدامها أو تزويد بيانات خاطئة الى الغاء او إيقاف الحساب.
      </p>
      <p>
        يحق لشركة سمارت فارما إلغاء أو تعديل برنامج نقاط ولاء بما في ذلك هذه
        الشروط والأحكام وفي أي وقت دون اخطار مسبق.
      </p>
    </div>
  );
};

export default MyPointsDescriptionAr;
